9/data/attachments/bb9a22cf309674ad.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>James_short_Friend_87909_4</nif:username>
            <nif:friendToBeRequested>soap_friends_fab22856-611d-4f4b-9475-f7710b7ccd0a</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>